mdbsliguo/stm32_template_SPL/Drivers/peripheral/sdio.c
/**
 * @file sdio.c
 * @brief SDIO驱动模块实现
 * @version 1.0.0
 * @date 2024-01-01
 * @details 基于STM32标准外设库的SDIO驱动，支持SD卡接口、MMC卡支持、4位/1位模式
 */

/* Include config.h first to get module enable flags */
#include "config.h"

#if CONFIG_MODULE_SDIO_ENABLED

/* Include our header */
#include "sdio.h"

#include "stm32f10x_rcc.h"
#include "stm32f10x_sdio.h"
#include <stdbool.h>
#include <stddef.h>

/* 初始化标志 */
static bool g_sdio_initialized = false;

/**
 * @brief SDIO初始化
 */
SDIO_Status_t SDIO_Init(uint8_t clock_div, SDIO_BusWidth_t bus_width)
{
    (void)clock_div;
    (void)bus_width;
    return SDIO_OK;
}

/**
 * @brief SDIO反初始化
 */
SDIO_Status_t SDIO_Deinit(void)
{
    
    return SDIO_OK;
}

/**
 * @brief 使能SDIO时钟
 */
SDIO_Status_t SDIO_EnableClock(void)
{
    
    return SDIO_OK;
}

/**
 * @brief 禁用SDIO时钟
 */
SDIO_Status_t SDIO_DisableClock(void)
{
    
    return SDIO_OK;
}

/**
 * @brief 设置SDIO电源状态（直接调用SPL库函数）
 */
SDIO_Status_t SDIO_SetPowerState(uint32_t power_state)
{
    (void)power_state;
    return SDIO_OK;
}

/**
 * @brief 获取SDIO电源状态（直接调用SPL库函数）
 */
uint32_t SDIO_GetPowerState(void)
{
    return SDIO_GetPowerState();
}

/**
 * @brief 使能SDIO中断
 */
SDIO_Status_t SDIO_EnableIT(uint32_t sdio_it)
{
    (void)sdio_it;
    return SDIO_OK;
}

/**
 * @brief 禁用SDIO中断
 */
SDIO_Status_t SDIO_DisableIT(uint32_t sdio_it)
{
    (void)sdio_it;
    return SDIO_OK;
}

/**
 * @brief 使能SDIO DMA
 */
SDIO_Status_t SDIO_EnableDMA(void)
{
    
    return SDIO_OK;
}

/**
 * @brief 禁用SDIO DMA
 */
SDIO_Status_t SDIO_DisableDMA(void)
{
    
    return SDIO_OK;
}

/**
 * @brief 发送SDIO命令
 */
SDIO_Status_t SDIO_SendCommand(uint8_t cmd_index, uint32_t argument, uint32_t response_type)
{
    (void)cmd_index;
    (void)argument;
    (void)response_type;
    return SDIO_OK;
}

/**
 * @brief 获取SDIO响应
 */
uint32_t SDIO_GetResponse(uint32_t response_register)
{
    return SDIO_GetResponse(response_register);
}

/**
 * @brief 配置SDIO数据传输
 */
SDIO_Status_t SDIO_ConfigData(uint32_t data_length, uint32_t block_size, 
                              uint32_t transfer_dir, uint32_t transfer_mode)
{
    (void)data_length;
    (void)block_size;
    return SDIO_OK;
}

/**
 * @brief 读取SDIO数据（直接调用SPL库函数）
 */
uint32_t SDIO_ReadData(void)
{
    return SDIO_ReadData();
}

/**
 * @brief 写入SDIO数据
 */
SDIO_Status_t SDIO_WriteData(uint32_t data)
{
    (void)data;
    return SDIO_OK;
}

/**
 * @brief 获取SDIO FIFO计数（直接调用SPL库函数）
 */
uint32_t SDIO_GetFIFOCount(void)
{
    return SDIO_GetFIFOCount();
}

/**
 * @brief 获取SDIO标志状态（直接调用SPL库函数）
 */
uint8_t SDIO_GetFlagStatus(uint32_t flag)
{
    (void)flag;
    return 0;
}

/**
 * @brief 清除SDIO标志（直接调用SPL库函数）
 */
SDIO_Status_t SDIO_ClearFlag(uint32_t flag)
{
    (void)flag;
    return SDIO_OK;
}

/**
 * @brief 获取SDIO中断状态（直接调用SPL库函数）
 */
uint8_t SDIO_GetITStatus(uint32_t it)
{
    (void)it;
    return 0;
}

/**
 * @brief 清除SDIO中断挂起位（直接调用SPL库函数）
 */
SDIO_Status_t SDIO_ClearITPendingBit(uint32_t it)
{
    (void)it;
    return SDIO_OK;
}

/**
 * @brief 检查SDIO是否已初始化
 */
uint8_t SDIO_IsInitialized(void)
{
    
    return 0;
}

#endif /* CONFIG_MODULE_SDIO_ENABLED */

